#+TITLE: speaker_notes

*** Source code blocks

Create a block with ~<s~

- shell ~ls~ and ~cd~
- elisp ~hello-world~ (format "")
- python ~hello-world~ (print vs output results)
- cpp ~hell o-world~ (more code use popup)
  #+BEGIN_SRC cpp
 #include <iostream>

int main() {
    std::cout << "Hello there" << std::endl;
    return 0;
}
  #+END_SRC

  #+RESULTS:
  : Hello there

- ~Ex1:~ cpp Eigen example (more advanced)

*** Emacs Calc
- ~Emacs calc~ just mentioned briefly, but it's more powerful then I thought

#+BEGIN_SRC calc
10 + 3 * 5 /2.0
#+END_SRC

#+BEGIN_SRC calc
cos(180)
#+END_SRC

Solve the ~x*2+x=4~ equation
#+BEGIN_SRC calc
x*2+x=4


fsolve(x*2+x=4,x)
#+END_SRC

Or how about a derivation
#+BEGIN_SRC calc
deriv(sqrt(x),x)
#+END_SRC

#+RESULTS:
: 0.5 / sqrt(x)

- ~Ex23~ table derivation
  formula: ~$2=deriv($1,x)~
